<template>
  <div class="h-screen bg-mainColor py-24 flex items-center justify-center relative">
    <img alt="" class="absolute w-full h-full top-0 left-0 z-10" src="@/assets/img/bg.png">
    <div class="container mx-auto px-4 lg:px-0">
      <div class="flex justify-between">
        <div v-for="(item, index) of blocks" :key="index"
             class="w-fourth relative" @mouseleave="activeBlock = null"
             @mouseover="activeBlock = index">
          <img :src="item.img" alt="" class="w-full">
          <div :class="{'!text-2xl': activeBlock === index}" class="bg-secondaryColor text-white absolute h-3/4">
            <h3 class="text-base font-bold">{{ item.title }}</h3>
            <p class="text-sm">{{ item.description }}</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import img1 from '@/assets/img/products/first.png'
import img2 from '@/assets/img/products/second.png'
import img3 from '@/assets/img/products/third.png'
import img4 from '@/assets/img/products/fourth.png'

export default {
  name: "ProductsBlock",
  components: {},
  data() {
    return {
      activeBlock: null,
      blocks: [
        {
          title: "АСКОУ – ИНВЕНТАРИЗАЦИЯ",
          description: "Обеспечивает инвентаризацию товарно-материальных ценностей, основных средств и прочих активов на Предприятии. Разработка данного решения была вызвана необходимостью учёта и контроля за объектами как в административном офисе, производственном предприятии, так и в любой иной организации, где необходимо вести учет активов. «АСКОУ – Инвентаризация» дает полную картину того, какими активами и в каком количестве располагает организация и её подразделения, хранит историю «жизни» объектов от момента поступления до списания и физического выбытия из организации. Функциональность системы помимо стандартной инвентаризации может включать в себя элементы контроля физического перемещения учитываемых активов с возможностью задать ограничение на их вынос за пределы назначенной территории (из кабинета, из офиса организации), осуществляет учет вноса-выноса контролируемых активов. Также в системе «АСКОУ – Инвентаризация» есть возможность привязки активов к локациям.",
          img: img1,
        },
        {
          title: "АСКОУ – СКЛАД",
          description: "«АСКОУ – Склад» – учет, инвентаризация и отслеживание местоположения объектов ТМЦ на складе. Любая крупная производственная компания имеет много складов, на которых хранится несколько тысяч, а то и десятков тысяч номенклатурных позиций, по каждой из которых может быть много и очень много объектов товарно-материальных ценностей, ТМЦ. Обычно инвентаризация такого огромного количества ТМЦ занимает продолжительное время, исчисляемое месяцами. И в большинстве случаях проводится вручную. Чтобы сократить время инвентаризации практически до одного дня, а сам процесс сделать прозрачным и автоматизированным, был создан комплекс «АСКОУ – Склад». «АСКОУ – Склад» позволяет инвентаризировать, оприходовать и выдавать ТМЦ со Склада на базе RFID технологий, с возможностью интеграции с действующими учетно-финансовыми системами предприятия.",
          img: img2,
        },
        {
          title: "АСКОУ – ОХРАНА ТРУДА И ТЕХНИКА БЕЗОПАСНОСТИ",
          description: "Модуль предназначен для регистрации проведения инструктажей. Модуль предназначен для создания, ведения и регистрации проведения различных инструктажей по ОТТБ (Охраны Труда и Техники Безопасности). При этом на мобильном устройстве регистрируются подпись инструктора и инструктируемого, а также фотография инструктируемого в момент проведения инструктажа. Данная функциональность может, также, использоваться для медицинского освидетельствования и регистрации сотрудника на рабочем месте.",
          img: img3,
        },
        {
          title: "АСКОУ – ТЕХНИЧЕСКОЕ ОБСЛУЖИВАНИЕ И РЕМОНТ",
          description: "Автоматизированное планирование технического обслуживания оборудования инфраструктуры, контроля исполнения и оперативный учет работ. Крупные и территориально распределенные компании имеют много оборудования и инфраструктурных объектов, которое надо обслуживать согласно техническим регламентам. Правильное и подконтрольное обслуживание обеспечивает гарантию правильной работы оборудования. В особенности это важно и критично, если оборудование должно обеспечить безопасность движения поездов, самолетов и др. Система позволяет контролировать выполнение запланированных работ вне зависимости от отраслевой специфики предприятия и в режиме реального времени. Сбор данных по отклонениям в работе позволяет анализировать и планировать дальнейшие специальные работы по сокращению сбоев и отказов оборудования.",
          img: img4,
        },
      ]
    };
  },
};
</script>